* Step 4: Another analysis
  - Another analysis directory with another data file.
  - Say that some of the analysis for this new dataset is similar to the analysis
    performed on the first dataset: *we want to reuse our package*.
  - Cannot import tstools from ~analysis2~ because the package cannot
    be found in the current directory.
  - python looks in a list of directories, starting from the current directory
    #+begin_src python :results output
      import sys
      print(sys.path)
    #+end_src

    #+RESULTS:
    : ['', '/home/thibault/.pyenv/versions/3.8.5/lib/python38.zip', '/home/thibault/.pyenv/versions/3.8.5/lib/python3.8', '/home/thibault/.pyenv/versions/3.8.5/lib/python3.8/lib-dynload', '/home/thibault/repos/python-packaging-course/python-course-venv/lib/python3.8/site-packages']
  - Installing a package means putting its source directory into a directory where
    it can be found. Usually ~site-packages~.
  - /Remark: could copy to package directory in ~analysis2~ or add
    ~analysis1~ to ~sys.path~/. None is recommended.

* Step 7: Virtual environments
  - Can only have one version of a package at a time.
   #+begin_src shell :results output
     ls python-course-venv/lib/python3.8/site-packages | grep numpy
   #+end_src

   #+RESULTS:
   : numpy
   : numpy-1.19.4.dist-info
   : numpy.libs

  - This can cause conflicts when two packages depend on a different
    versions of a same package.

  - Virtual environments help *isolate* your project from other projects
    with different requirements.

  - Virtual environments can be created in several ways.f
    Built-in module ~venv~:
    #+begin_src shell
      python -m venv myvenv
      source myvenv/bin/activate
    #+end_src

    #+begin_src shell
      pip install --upgrade pip setuptools wheel
    #+end_src

    #+begin_src python :results output
      import sys
      print(sys.executable)
    #+end_src

    #+RESULTS:
    : /home/thibault/repos/python-packaging-course/python-course-venv//bin/python

  - Virtual environment use the same python interpreter as the one that was used 
    to create it. Therefore same version.

  - Virtual environments can sound like a useless overhead, but dependency problems
    arise quicker than you think. Hard to solve. Waste of time.

  - Unless you have a good reason to, never install a package into your global
    python environment. Some software depend on the Python packages installed in
    this environment and breaking it means breaking part of your system.

  - Typical workflow when package is relatively stable:
      #+begin_example
	analysis1/
		venv1/ (normal install)
	analysis2/
		venv2/ (normal install)
	tstools-dist
		venv-tstools/ (editable install)
      #+end_example

